

Medexam = '''<文本>: 外科学 ，飞飞兀 ［诊断】早期胃癌术后5年生存率可达90.9%-100%，明显优于进展期胃癌。因此，早期诊断是提高治愈率的关键。但由千早期胃癌无特异性症状，容易被忽视，国内早期胃癌的比例仅为10%左右。为提高早期胃癌诊断率，应对以下人群定期检查：(j)40岁以上，既往无胃病史而出现上述消化道症状者，或已有溃疡病史但症状和疼痛规律明显改变者；©有胃癌家族病史者；＠有胃癌前期病变者，如萎缩性胃炎胃溃疡屑息肉屑大部切除病史者；＠有原因不明的消化道慢性失血或短期内体重明显减轻者。
<问题>: 问题: 提高胃癌治愈率的关键在于（　　）。选项: A:术前、术中、术后化疗, B:根治性手术, C:早期诊断, D:放射治疗, E:综合治疗.

<文本>: 儿科学 【铁的代谢】尽 (2)婴幼儿期铁代谢的特点：足月新生儿体内总铁约75mg/kg，其中25％为贮存铁。生后由于“生理性溶血＂释放的铁较多，随后是“生理性贫血”期造血相对较低下，加之从母体获得的铁一般能满足4个月的需要，故婴儿早期不易发生缺铁。但早产儿从母体获得铁少，且生长发育更迅速，可较早发生缺铁。约4月龄以后，从母体获得的铁逐渐耗尽，加上此期生长发育迅速，造血活跃，因此对膳食铁的需要增加，而婴儿主食人乳和牛乳的铁含量均低，不能满足机体的需要，贮存铁耗竭后即发生缺铁，故6个月至2岁的小儿缺铁性贫血发生率高。(3)儿童期和青春期铁代谢特点：儿童期一般较少缺铁，此期缺铁的主要原因是偏食，使摄取的铁不足，或是食物搭配不合理，使铁的吸收受抑制；肠道慢性失血也是此期缺铁的原因。青春期由于生长发育迅速，对铁的需要量增加，初潮以后少女如月经过多造成铁的丢失也是此期缺铁的原因。【病因】1.先天储铁不足胎儿从母体获得的铁以妊娠最后3个月最多，故早产、双胎或多胎、胎儿失血和孕母严重缺铁等均可使胎儿储铁减少。2.铁摄入量不足这是缺铁性贫血的主要原因。人乳、牛乳、谷物中含铁量均低，如不及时添加含铁较多的辅食，容易发生缺铁性贫血。
<问题>: 问题: 哪项是6个月以后婴儿发生缺铁性贫血的主要原因？（　　）选项: A:生长发育快, B:钩虫病, C:慢性腹泻, D:未及时添加含铁丰富食物, E:铁不足.'''

Dubaike = '''<文本>: 寻常型牛皮癣 描述 寻常型牛皮癣是临床上最为常见的类型。初起为红色丘疹或斑丘疹，以后逐渐扩大或相互融合，形成边界清楚的斑片，表面覆盖银白色鳞屑，轻轻刮除鳞屑后显露光滑的薄膜，再刮后可出现多个细小出血点。上述鳞屑，薄膜和点状出血是该病的三大临床特征。该病可发生于身体的任何部位，呈对称性分布，好发于膝、肘关节伸侧和头部，少数病人的指（趾）甲呈点状（顶针状）凹陷。临床上有急性进展期、静止期和消退期。
<问题>: 牛皮鲜有什么症状？

<文本>: 阻生牙拔除术 注意事项 拔牙后需紧咬棉球30-40分钟拔牙24小时内不要漱口或刷牙，以预防出血。拔牙两小时后可进食，食物不宜过热，避免用拔牙侧咀嚼。拔牙后勿用舌头舔创口，更不宜反复吸吮，以便保护拔牙创内已凝结的血块，有利于创口的愈合，防止术后出血和感染。
<问题>: 拔牙以后注意事项'''

Dxydisease = '''<文本>: 胃黏膜糜烂灶是指胃的黏膜有糜烂或者溃烂，病变可呈点状或者片状，也可以呈条状，是糜烂性胃炎的胃镜下表现。 胃黏膜糜烂灶进一步往深部进展，到达胃的肌层会引起胃窦溃疡，需要引起重视，配合专科医生给予使用药物治疗，具体用药可以咨询专科医生。 胃黏膜糜烂灶是可以治愈的疾病，不用过于担心。
<问题>: 胃镜检查报告中「胃黏膜糜烂灶」是什么意思？

<文本>: 全身皮肤检查、血细胞分析、胸部 X 线等，部分患者会根据情况选择 CT 或 PET/CT 检查、淋巴结活检、骨髓活检等。
<问题>: 原发性皮肤 T 细胞淋巴瘤诊断时需要做什么检查？'''

Medical = '''<文本>: 在不伴有潜在脑畸形情况下良性蛛网膜下腔增宽的儿童发育往往正常。如果有巨头存在时，在出生时头围往往在正常的高限中，生后数月迅速增大，就诊时可达95％以上，但在临床上发育延迟。在典型情况下，2周岁时头围恢复正常。建议到正规医院进行检查，对症治疗。
<问题>: 宝宝良性蛛网膜下腔增宽，能治疗吗？

<文本>: 3岁以上小儿睡眠中小便自遗，醒后方觉的一种病证。 指导意见： 本病的发生，是由于小儿智力未健，排尿的正常习惯尚未养成，因而未能自立排尿。一般地说，遗尿多与胃和膀胱虚冷有关。
<问题>: 小儿遗尿怎么办？脊柱裂呢，两者的关系'''

Cmedqa = '''<文本>: 灰指甲是手部常见皮肤病，现在，绝大多数灰指甲可以治好。常用的方法是:伊曲康唑200mg2/日1周/月，甲癣服3个周期，趾甲癣4个周期。特比萘芬250mg/日口服3~4周，停药后病甲好转，直至新甲完全长出
<问题>: 脚上的灰指甲用亮甲可以除掉吗

<文本>: 很明显你是得了霉菌性阴道炎，感染的原因用多种霉菌性阴道炎容易引起反反复复的可能性。应注意个人卫生，勤换内裤，用过的内裤，盆，毛巾等应用开水烫洗，并在阳光下晒干。应合理应用抗生素及激素类药物
<问题>: 检查过妇科，说是阴道炎，开了药吃完了。还是尿频尿急'''

Dxyconsult = '''<文本>: 您好，让您久等了。您的情况我已认真了解，但本着对您负责的态度，根据病情需要，需要您认真逐条详细提供以下一些情况，帮助您诊疗：1.皮疹瘙痒还是疼痛？偶尔稍痒还是很痒？2.有没有掉皮现象？3.这些环形皮疹是否表面凸出隆起皮肤一圈？4.起皮疹前有没有感冒发烧嗓子疼等症状？5.最开始是否先起来一片大的皮疹，后来才发展的越来越多小的皮疹？
<问题>: 症状及患病时长：2个月了，腿上有疹子。就医及用药情况：无。需要解答的问题：是什么病？严重吗？

<文本>: 您好，以往在这个部位有没有出现类似情况？根据您的皮疹情况考虑单纯疱疹可能，这个是单纯疱疹病毒感染引起，抵抗力下降容易反复发作。可外用阿昔洛韦乳膏，一天3次左右，口服阿昔洛韦片，一天3次，一次400mg，或伐昔洛韦，每天1次，每次500mg。连用1周。多喝水。尽量避免熬夜，忌酒及辛辣刺激性食物。
<问题>: 症状及患病时长：就前天嘴角开始长一些小痘痘，很痒，嘴唇有点肿，小痘痘戳破会出水。就医及用药情况：暂时没有用药。需要解答的问题：这是什么症状？如何用药？是否具有传染性？'''

Covid = '''<文本>: 关于暂停特种设备作业人员考试及证件复审工作的通知北京市特种设备检测中心，各相关单位及人员：为贯彻落实国务院、市委、市政府关于新型冠状病毒感染的肺炎疫情防控指示精神，根据《北京市人民政府关于进一步明确责任加强新型冠状病毒感染的肺炎预防控制工作的通知》要求，有效减少人员聚集，阻断疫情传播，保障全市特种设备作业人员考生和相关人员身体健康和生命安全。自即日起暂停我市特种设备作业人员考试及证件复审工作，在停考期间到期的相关证书，仍继续有效。具体考试和证件复审恢复时间另行通知。北京市市场监督管理局2020年2月1日
<问题>: 北京市特种设备作业人员考试及证件复审工作暂停期间到期的相关证书是否仍然有效？

<文本>: 近八成四川国企实现复工新华社成都2月14日电（记者高健钧）记者14日从四川省国资委获悉，截至目前，四川省属国企复工数量达1043户，复工率78.2%。据介绍，为推动国有企业在打赢疫情防控阻击战、稳定经济运行中发挥作用，按照相关部署，在科学防疫防控的前提下，四川省国资委组织粮油蛋奶、水电煤气、通信网络等重点国有企业，以及天府国际机场、汉巴南铁路、成资渝高速公路、眉山1万吨锂盐等重点项目复工复产。据了解，已复工的1043户国企为22户省属监管企业所属在川单户企业，其中重要必需领域单户企业复工253户，复工率达85.5%。
<问题>: 截至2月14日，四川国资委组织了哪些重点项目复工复产？'''

IIYI = '''<文本>: 主诉：咳嗽、咳痰10余天，突发胸闷、气短、胸痛1天,现病史：患者于入院10天前感冒后出现咳嗽、咳痰，咳白色泡沫痰，无胸闷、气短，无发热、寒战，无咯血、胸痛，无咯脓性痰，自行口服止咳、化痰、消炎药物治疗后效果不加，于入院前1天咳嗽后突感右侧胸部剧烈疼痛，不能忍受，深呼吸时胸痛明显。遂来就诊。查体：P 92次/分，BP 130/85mmHg 双侧胸廓对称，无胸壁静脉曲张,右侧第8肋骨与肋软骨交界附近压痛明显，未触及骨擦感，胸廓挤压试验阳性，双肺呼吸音清，未闻及干湿啰音。心律齐，心脏各瓣膜听诊区未闻及病理性杂音。请讨论：患者目前诊断考虑什么?
<标题>: 28岁男性，咳嗽、咳痰10余天，突发胸闷、胸痛1天

<文本>: 性别：男,年龄：11足岁,职业：小学学生,食药物过敏史：未发现,主诉：头痛、呕吐2小时余,现病史：,无明显诱因在班级听课时突发头痛、昏倒在地，伴呕吐数次，少许咖啡样胃内容物，无抽搐紫绀、口吐泡沫等。于昨下午急诊住入小儿内科，急查颅脑CT示：小脑蚓部出血（当时量约8ml），诊断：1、小脑出血（自发性）2、急性应激性胃黏膜病变；予甘露醇、白蛋白、速尿等联合降颅压、止血敏止血、头孢唑啉预防感染及保护胃粘膜、鼻饲管等处理，当时小便能自解，查体：神志朦胧、易烦躁，双侧瞳孔等大等圆约2mm，对光反射存在，四肢肌力正常，肌张力稍高。今早复查颅脑CT示：小脑蚓部出血，破入脑室，继续降颅压、止血（止血敏+蛇毒凝血酶，拟用3天），预防感染（头孢替安）等处理，患孩因烦躁自行拔除鼻饲管，予留置导尿，备行“侧脑室引流术”，既往史：无特殊,求教问题：,1、侧脑室引流术时机及拔管时机,2、查因所需检查项目（MRI、DSA）及时机,3、预后（与压迫时间关系）
<标题>: 12岁儿童自发性小脑出血'''

CSLCite = '''<文本>: 感染因素一直认为是复发性口疮及口腔扁平苔藓的可能病因之一.许多学者对多种可能的病原微生物作了一定研究,为以上两种疾病的感染病因学提供了一些证据.其中复发性口疮的可能致病微生物为链球菌、幽门螺杆菌、疱疹病毒;而丙型肝炎病毒及人乳头瘤病毒则可能参与了口腔扁平苔藓的发病.
<标题>: 综合治疗与封闭治疗口腔扁平苔藓的对比研究

<文本>: 目的:研制功能性抗cD40L单克隆抗体,探讨其生物学特性及其运用价值.方法:采用B淋巴细胞融合、免疫荧光、免疫印迹和竞争抑制等方法获得鼠抗人CD40LmAb,通过Daudi细胞生长抑制试验、混合淋巴细胞反应观察抗CD40LmAb的生物学功能.结果:经表型分析、Western blot和竞争抑制试验,证实mAbBl、mAb4F1是识别人CD40L分子的特异性单抗,且识别的位点不同;mAbBl、mAb4F1均能不同程度地拮抗CD40L-TC介导的Daudi细胞生长抑制和抑制混合淋巴细胞反应.结论:成功地获得两株能稳定分泌特异性抗人CD40L单克隆抗体的杂交瘤(1B1、4F1),这两株单抗对cD40L的生物学功能具有明显的阻断作用,为阻断型单抗.
<标题>: 阻断型CD154抗体和CD80抗体生物学作用的研究'''

CSLRelated = '''<文本>: {"id": "q0023", "text": 64排螺旋CT和MRI检查对直肠癌术前分期的诊断价值对比分析\t目的 探讨64排螺旋CT和MRI检查用于直肠癌术前分期诊断中的临床价值.方法 经术后病理证实的72例直肠癌患者,其中36例用64排螺旋CT检查;36例用1.5T MRI检查比较两组患者的直肠癌分期的灵敏度.结果 MRI组直肠癌术前T分期N分期诊断灵敏度优于CT组,差异有统计学意义(P<0.05).结论 在直肠癌术前分期诊断中64排螺旋CT和MRI均有理想效果,但二者相比,MRI灵敏度、特异度更高,同时检查费用也更高,在临床选择中,应该根据实际情况合理应用.
<相似文本>: 多排螺旋CT双体位检查对结直肠癌术前评估的价值再探\t目的:探讨多排螺旋CT(MSCT)双体位检查对结直肠癌术前分期的价值.材料和方法:搜集102例经肠镜确诊的直肠癌患者行MSCT仰卧、俯卧位扫描,扫描前清洁肠道,并经肛门注气,扫描范围从膈顶至耻骨联合下缘.102例结直肠癌患者全部经肠镜或手术病理证实,全部病例均有手术、术前MSCT、术后病理等完整资料参与分期研究,将影像诊断结果与手术病理结果进行对照.结果:MSCT总的分期准确率82.4%(84/102),判断T、N、M分期的准确率分别是93.1%(95/102)、83.3%(85/102)、99.0%(101/102),判断淋巴结转移的敏感性和特异性分别为93.9%和88.7%.结论:MSCT双体位扫描对直肠癌的术前分期有重要价值,有助于判断肿瘤浆膜外侵犯及区域淋巴结转移情况.

<文本>: 波浪形耳周美容切口腮腺手术43例临床护理\t目的:探讨波浪形耳周美容切口腮腺手术患者的护理方法.方法:对43例腮腺手术患者术前、术后观察与护理.结果:43例患者均达临床一期愈合,无感染和涎瘘发生,5例患者术后出现暂时性面瘫,3～6个月内恢复,2例患者出现味觉出汗综合征.该切口的美观效果得到患者认可.所有患者1年后复查均未复发.结论:对腮腺手术患者进行科学而合理的护理,有利于预防并减少手术并发症的发生,保证手术质量.
<相似文本>: 美容切口在腮腺肿瘤外科中的应用\t目的 评价腮腺美容切口在腮腺肿瘤切除术中应用的临床价值.方法 收集28例腮腺肿瘤患者,采用由面部除皱切口改良而来的腮腺美容切口入路,进行保留面神经和耳大神经的腮腺切除术,并联合颈清拐杖式切口手术入路,治疗腮腺恶性肿瘤.随访观察该切口的美观程度以及临床疗效.结果 所有患者均达临床Ⅰ期愈合,无涎瘘发生.1例患者术后出现暂时面瘫,2个月后恢复.所有患者术后均出现不同程度的耳垂麻木,除3例患者耳大神经损伤外,其余患者耳垂麻木于术后2个月恢复.患者对该切口的美观程度十分满意.结论 腮腺美容切口入路隐蔽,美容效果好,腮腺任何部位的肿瘤都可以采用此术式.'''

few_shot_example = [Medexam, Dubaike, Dxydisease, Medical, Cmedqa, Dxyconsult, Covid]